birth = input("วัน/เดือน/ปี :")
d, m, y = map(int, birth.split("/"))

zodiacs = ["มะเส็ง","มะเมีย","มะแม","วอก","ระกา","จอ","กุน","ชวด","ฉลู","ชาล","เถาะ","มะโรง"]
signs = ["ราศีธนู", "ราศีมังกร", "ราศีกุมภ์", "ราศีมีน", "ราศีเมษ", "ราศีพฤษภ", "ราศีเมถุน", "ราศีกรกฎ", "ราศีสิงห์", "ราศีกันย์", "ราศีตุล", "ราศีพิจิก"]
boundaries = [22, 21, 20, 21, 21, 21, 22, 24, 24, 24, 24, 23]

zodiac = zodiacs[y % 12]
sign = signs[m - 1] if d < boundaries[m - 1] else signs[m % 12]

print(f"{sign} ปีนักษัตร:{zodiac}")
